Revit 2026 API

# EnergyDataSettingsBuildingConstructionClass Property

---

Used for both the detailed and conceptual energy model Construction class of building as defined by: loose, medium, tight, or none.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public HVACLoadConstructionClass BuildingConstructionClass { get; set; }
```
```vb
Public Property BuildingConstructionClass As HVACLoadConstructionClass
	Get
	Set
```
```cpp
public:
property HVACLoadConstructionClass BuildingConstructionClass {
	HVACLoadConstructionClass get ();
	void set (HVACLoadConstructionClass value);
}
```
```fsharp
member BuildingConstructionClass : HVACLoadConstructionClass with get, set
```

#### Property Value

HVACLoadConstructionClass

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The building construction class does not fall within an appropriate range. |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace